In [28]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# PANDAS CHEET SHEET

In [29]:
# CREATING DATAFRAME 
df = pd.DataFrame(
                   {"a" : [4, 5, 6], 
                    "b" : [7, 8, 9], 
                    "c" : [12, 11, 10]}, )

In [30]:
df

   a  b   c
0  4  7  12
1  5  8  11
2  6  9  10

In [31]:
## u have change and add the cloum names
df.columns=['dhana','kd','hari']

In [32]:
df

   dhana  kd  hari
0      4   7    12
1      5   8    11
2      6   9    10

In [33]:
# u have to rename the kd to replace gayu 
df=df.rename(columns={'kd': 'gayu'})

In [34]:
df

   dhana  gayu  hari
0      4     7    12
1      5     8    11
2      6     9    10

In [35]:
#Gather columns into rows
pd.melt(df)

  variable  value
0    dhana      4
1    dhana      5
2    dhana      6
3     gayu      7
4     gayu      8
5     gayu      9
6     hari     12
7     hari     11
8     hari     10

In [36]:
# Order rows by values of a column (low to high)
df.sort_values('hari')

   dhana  gayu  hari
2      6     9    10
1      5     8    11
0      4     7    12

In [37]:
 # Order rows by values of a column (high to low).
df.sort_values('hari', ascending=False)

   dhana  gayu  hari
0      4     7    12
1      5     8    11
2      6     9    10

In [38]:
df1 = pd.DataFrame(
                   {"a" : [5, 6, 7], 
                    "b" : [7, 8, 9], 
                    "c" : [10, 11, 12]}, )

In [39]:
df1

   a  b   c
0  5  7  10
1  6  8  11
2  7  9  12

In [40]:
# Append columns of DataFrame
# axis=1 it is called as row 
pd.concat([df,df1], axis=1)

   dhana  gayu  hari  a  b   c
0      4     7    12  5  7  10
1      5     8    11  6  8  11
2      6     9    10  7  9  12

In [41]:
# axis=0  it is called as clounm
pd.concat([df,df1], axis=0)

   dhana  gayu  hari    a    b     c
0    4.0   7.0  12.0  NaN  NaN   NaN
1    5.0   8.0  11.0  NaN  NaN   NaN
2    6.0   9.0  10.0  NaN  NaN   NaN
0    NaN   NaN   NaN  5.0  7.0  10.0
1    NaN   NaN   NaN  6.0  8.0  11.0
2    NaN   NaN   NaN  7.0  9.0  12.0